tap "altinity/clickhouse"
tap "azure/azd"
tap "azure/functions"
tap "cargo-lambda/cargo-lambda"
tap "old/formulas"
tap "spring-io/tap"
brew "advancecomp"
brew "jpeg-xl"
brew "aom"
brew "atuin"
brew "bacon"
brew "automake"
brew "azcopy"
brew "libyaml"
brew "python@3.13"
brew "azure-cli"
brew "bat"
brew "blueutil"
brew "glib"
brew "cairo"
brew "cmake"
brew "ripgrep"
brew "sd"
brew "codex"
brew "node"
brew "coreutils"
brew "curl"
brew "dasel"
brew "difftastic"
brew "direnv"
brew "dive"
brew "dnsmasq"
brew "docker-compose"
brew "fd"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gdbm"
brew "gh"
brew "harfbuzz"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "gitleaks"
brew "hurl"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gobject-introspection"
brew "gopass"
brew "bottom"
brew "dust"
brew "hunspell"
brew "hyperfine"
brew "icu4c@76", link: true
brew "icu4c@77"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jhead"
brew "jpeg"
brew "jpegoptim"
brew "jaq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "libass"
brew "libffi"
brew "libmng"
brew "libraw"
brew "librist"
brew "lsd"
brew "mas"
brew "mdcat"
brew "mise"
brew "mkcert"
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "nss"
brew "optipng"
brew "oxipng"
brew "pngcrush"
brew "pngquant"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "proj"
brew "procs"
brew "pv"
brew "pycparser"
brew "qt"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "srt"
brew "starship"
brew "stylua"
brew "testssl"
brew "tig"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "trivy"
brew "uv"
brew "wget"
brew "wrk"
brew "xclip"
brew "xh"
brew "yamllint"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "azure/azd/azd"
brew "azure/functions/azure-functions-core-tools@4"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
cask "1password-cli"
cask "alt-tab"
cask "copilot-cli"
cask "font-0xproto-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "ghostty"
cask "imageoptim"
cask "multipass"
cask "orbstack"
cask "raycast"
cask "rectangle"
cask "sequel-ace"
cask "zed"
cargo "bunyan"
cargo "cargo-audit"
cargo "cargo-bloat"
cargo "cargo-cache"
cargo "cargo-diet"
cargo "cargo-expand"
cargo "cargo-generate"
cargo "cargo-lambda"
cargo "cargo-outdated"
cargo "cargo-udeps"
cargo "cargo-unused-features"
cargo "cargo-watch"
cargo "ctr"
cargo "evcxr_repl"
cargo "rusty-hook"
cargo "sqlx-cli"
cargo "twiggy"
cargo "wasm-pack"
cargo "worker-build"
cargo "workshop-runner"
