tap "altinity/clickhouse"
tap "azure/azd"
tap "azure/functions"
tap "cargo-lambda/cargo-lambda"
tap "old/formulas"
tap "spring-io/tap"
brew "advancecomp"
brew "jpeg-xl"
brew "aom"
brew "atuin"
brew "bacon"
brew "automake"
brew "azcopy"
brew "libyaml"
brew "python@3.13"
brew "azure-cli"
brew "bat"
brew "blueutil"
brew "glib"
brew "cairo"
brew "cmake"
brew "ripgrep"
brew "sd"
brew "codex"
brew "node"
brew "contentful-cli"
brew "coreutils"
brew "curl"
brew "dasel"
brew "difftastic"
brew "direnv"
brew "dive"
brew "dnsmasq"
brew "docker-compose"
brew "fd"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gdbm"
brew "gh"
brew "harfbuzz"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "gitleaks"
brew "hurl"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gobject-introspection"
brew "gopass"
brew "bottom"
brew "dust"
brew "hunspell"
brew "hyperfine"
brew "icu4c@76", link: true
brew "icu4c@77"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jhead"
brew "jpeg"
brew "jpegoptim"
brew "jaq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "libass"
brew "libffi"
brew "libmng"
brew "libraw"
brew "librist"
brew "lsd"
brew "mas"
brew "mdcat"
brew "mise"
brew "mkcert"
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "nss"
brew "optipng"
brew "oxipng"
brew "pngcrush"
brew "pngquant"
brew "pnpm"
brew "podman"
brew "podman-compose"
brew "podman-tui"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "proj"
brew "procs"
brew "pv"
brew "pycparser"
brew "qt"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "srt"
brew "starship"
brew "stylua"
brew "testssl"
brew "tig"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "trivy"
brew "uv"
brew "wget"
brew "wrk"
brew "xclip"
brew "xh"
brew "yamllint"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "azure/azd/azd"
brew "azure/functions/azure-functions-core-tools@4"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
cask "1password-cli"
cask "alt-tab"
cask "copilot-cli"
cask "font-0xproto-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "ghostty"
cask "imageoptim"
cask "multipass"
cask "orbstack"
cask "podman-desktop"
cask "raycast"
cask "rectangle"
cask "sequel-ace"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "AdBlock", id: 1402042596
mas "Harvest", id: 506189836
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "MeetingBar", id: 1532419400
mas "Microsoft Excel", id: 462058435
mas "MindNode Classic", id: 1289197285
mas "Numbers", id: 409203825
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
vscode "2ndshift.fresh-material"
vscode "42crunch.vscode-openapi"
vscode "af4jm.vscode-icalendar"
vscode "ahmadalli.vscode-nginx-conf"
vscode "akamud.vscode-theme-onedark"
vscode "alexkrechik.cucumberautocomplete"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "anthropic.claude-code"
vscode "azurite.azurite"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "catppuccin.catppuccin-vsc"
vscode "cipchk.cssrem"
vscode "cloudflare.cloudflare-workers-bindings-extension"
vscode "connor4312.esbuild-problem-matchers"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "fcrespo82.markdown-table-formatter"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hagent.zed-editor-dark-theme"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "hverlin.mise-vscode"
vscode "jonaduran.my-light-theme"
vscode "kumar-harsh.graphql-for-vscode"
vscode "lkytal.coffeelinter"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "naumovs.color-highlight"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "orta.vscode-jest"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "respectmathias.zed-icons-colored"
vscode "rokoroku.vscode-theme-darcula"
vscode "rosshamish.kuskus-kusto-syntax-highlighting"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "somewhatstationery.some-sass"
vscode "sonarsource.sonarlint-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tommasov.hosts"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "webfreak.debug"
vscode "zoellner.openapi-preview"
cargo "bunyan"
cargo "cargo-audit"
cargo "cargo-bloat"
cargo "cargo-cache"
cargo "cargo-diet"
cargo "cargo-expand"
cargo "cargo-generate"
cargo "cargo-lambda"
cargo "cargo-outdated"
cargo "cargo-udeps"
cargo "cargo-unused-features"
cargo "cargo-watch"
cargo "ctr"
cargo "evcxr_repl"
cargo "rusty-hook"
cargo "sqlx-cli"
cargo "twiggy"
cargo "wasm-pack"
cargo "worker-build"
cargo "workshop-runner"
