ack
bash
coffee-script
coreutils
couchdb
couchdb-lucene
distribute
erlang
gawk
gdbm
gettext
git
gnutls
grep
growlnotify
icu4c
libgcrypt
libgpg-error
libtasn1
lynx
macvim
maven
monit
mysql
neon
node
nspr
pcre
pkg-config
python
readline
redis
scala
scons
spidermonkey
sqlite
tree
unrar
v8
vcprompt
wget
